In [4]:
import pandas as pd

data = {
    "Name": ["Ravi", "Sita", "Amit", "Priya", "Kiran", "Anita"],
    "Age": [25, 30, 22, 28, 35, 27],
    "Salary": [50000, 60000, 45000, 70000, 80000, 52000],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "Finance"]
}


df=pd.DataFrame(data)
df

    Name  Age  Salary Department
0   Ravi   25   50000         HR
1   Sita   30   60000         IT
2   Amit   22   45000    Finance
3  Priya   28   70000         IT
4  Kiran   35   80000         HR
5  Anita   27   52000    Finance

In [ ]:
df.head(2) # First 2 records

   Name  Age  Salary Department
0  Ravi   25   50000         HR
1  Sita   30   60000         IT

In [ ]:
df.sample(2) # give us random of 3 records

    Name  Age  Salary Department
4  Kiran   35   80000         HR
5  Anita   27   52000    Finance

In [ ]:
df.head() # Default 5 records

    Name  Age  Salary Department
0   Ravi   25   50000         HR
1   Sita   30   60000         IT
2   Amit   22   45000    Finance
3  Priya   28   70000         IT
4  Kiran   35   80000         HR

In [ ]:
df.sample() # Default 1 record

    Name  Age  Salary Department
3  Priya   28   70000         IT

In [ ]:
print(df)
print("===============================")
df.tail() # give us last 5 records by default

    Name  Age  Salary Department
0   Ravi   25   50000         HR
1   Sita   30   60000         IT
2   Amit   22   45000    Finance
3  Priya   28   70000         IT
4  Kiran   35   80000         HR
5  Anita   27   52000    Finance
===============================

    Name  Age  Salary Department
1   Sita   30   60000         IT
2   Amit   22   45000    Finance
3  Priya   28   70000         IT
4  Kiran   35   80000         HR
5  Anita   27   52000    Finance

In [ ]:
df.tail(2)

    Name  Age  Salary Department
4  Kiran   35   80000         HR
5  Anita   27   52000    Finance